# Problem 2
NIM/Nama : 19623034/Refki Alfarizi\
Tanggal : 7 November 2023\
Deskripsi : Program menuliskan data berikut.
 1. Nilai matematika, fisika, dan kimia milik Tuan Ric.
 2. Mahasiswa dengan nilai fisika tertinggi.
 3. 10 Mahasiswa dengan nilai kimia tertinggi.
 4. Banyaknya nilai matematika di bawah 50.
 5. Banyaknya mahasiswa FMIPA.

### Inisiasi Data

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("H05.csv")

In [3]:
df

                          nama fakultas  nilai_mat  nilai_kim  nilai_fis
0         Farhan Fathur Rahman    FMIPA      57.21      34.14      38.93
1               Steven Margono    FMIPA      67.43      51.50      57.20
2                 Ryan Sentosa    SAPPK      90.62      37.38      40.73
3         Muhajah Babny Muslim    FMIPA      72.31      38.80      44.79
4             Alvin Natawiguna     FTSL      65.45      57.67      56.39
...                        ...      ...        ...        ...        ...
5130               Khoirrashif    SITHR      66.14      46.82      56.74
5131      Jefri Hendri Adriano     FTSL      53.68      34.74      33.76
5132               Iki Hidayat     FITB      69.63      35.04      37.65
5133  Muhammad Nashir Sitompul      FTI      79.69      39.06      50.17
5134     Billy Richardo Sagala     STEI      68.68      51.23      66.18

[5135 rows x 5 columns]

### 1. Nilai matematika, fisika, dan kimia milik Tuan Ric

In [4]:
df[df["nama"] == "Tuan Ric"]

          nama fakultas  nilai_mat  nilai_kim  nilai_fis
3513  Tuan Ric     STEI      96.78      62.23      30.53

### 2. Mahasiswa dengan nilai fisika tertinggi

In [10]:
imax = df["nilai_fis"].idxmax()
df[imax: imax+1]

                         nama fakultas  nilai_mat  nilai_kim  nilai_fis
1936  Yuniar Fazriani Rusmana     FITB      53.61      67.19      92.57

### 3. 10 Mahasiswa dengan nilai kimia tertinggi

In [13]:
df.sort_values(["nilai_kim"], ascending=[0])[:10]

                          nama fakultas  nilai_mat  nilai_kim  nilai_fis
2554      Faathir Reza Avicena     FTSL      57.12      81.50      78.68
2779      Dinda A A Z Mundakir     STEI      41.18      81.34      82.60
3544        Tammya Ayu Purnomo    SITHS      74.49      81.20      78.58
4934    Alyssa Nadhira Windari     FTMD      78.38      78.83      78.68
1137          Izni Nur Ibrahim     STEI      56.70      78.46      84.34
2262      Rinaldi Oky Setiawan     STEI      71.22      77.44      83.66
4070      Ias Azhari Rezkyarno    FMIPA      62.85      76.90      81.52
2945           Klara Petra T T     FTSL      73.39      76.61      78.12
1788  Naudy Germanimo Laksmana     FTMD      62.29      76.38      76.15
1310       Mardliyahtur Rohmah     STEI      63.15      76.36      74.06

### 4. Banyaknya nilai matematika di bawah 50

In [14]:
len(df[df["nilai_mat"] < 50])

329

### 5. Banyaknya mahasiswa FMIPA

In [16]:
len(df[df["fakultas"] == "FMIPA"])

627